course-materials/day-4/performance-analysis-lab/load-test-optimized.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: 'Optimized app warm up'
    - duration: 120
      arrivalRate: 15
      rampTo: 40
      name: 'Optimized app ramp up'
    - duration: 300
      arrivalRate: 40
      name: 'Optimized app sustained load'
    - duration: 60
      arrivalRate: 40
      rampTo: 10
      name: 'Optimized app ramp down'

  defaults:
    headers:
      'User-Agent': 'Artillery Optimized Load Test'
      'Accept': 'application/json'

scenarios:
  - name: 'Optimized product browsing'
    weight: 50
    flow:
      - get:
          url: '/api/products?page={{ $randomInt(1, 10) }}&limit=20'
          capture:
            - json: '$.products[0].id'
              as: 'productId'
      - think: 1
      - get:
          url: '/api/products/{{ productId }}'
      - think: 1
      - get:
          url: "/api/search?q={{ $pick(['laptop', 'phone', 'book', 'clothing', 'electronics']) }}&limit=15"

  - name: 'Heavy search testing'
    weight: 35
    flow:
      - get:
          url: '/api/search?q={{ $randomString() }}&limit=25'
      - get:
          url: '/api/search?q=test&limit=20'
      - think: 1
      - get:
          url: "/api/search?q={{ $pick(['gaming', 'sports', 'home', 'beauty', 'automotive']) }}&limit=10"

  - name: 'Report and analytics'
    weight: 10
    flow:
      - get:
          url: '/api/reports/sales'
      - think: 3
      - get:
          url: '/api/cache/stats'
      - get:
          url: '/health'

  - name: 'Performance monitoring'
    weight: 5
    flow:
      - get:
          url: '/health'
      - get:
          url: '/api/cache/stats'
      - think: 2
      - get:
          url: '/api/products?page=1&limit=50'