course-materials/day-4/performance-analysis-lab/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: 'Warm up phase'
    - duration: 120
      arrivalRate: 10
      rampTo: 25
      name: 'Ramp up load'
    - duration: 300
      arrivalRate: 25
      name: 'Sustained load'
    - duration: 60
      arrivalRate: 25
      rampTo: 5
      name: 'Ramp down'

  defaults:
    headers:
      'User-Agent': 'Artillery Load Test'
      'Accept': 'application/json'

scenarios:
  - name: 'Product browsing workflow'
    weight: 50
    flow:
      - get:
          url: '/api/products?page=1&limit=20'
          capture:
            - json: '$.products[0].id'
              as: 'productId'
      - think: 2
      - get:
          url: '/api/products/{{ productId }}'
      - think: 1
      - get:
          url: '/api/search?q=laptop&limit=10'

  - name: 'Search-heavy workflow'
    weight: 30
    flow:
      - get:
          url: '/api/search?q={{ $randomString() }}&limit=20'
      - think: 1
      - get:
          url: '/api/search?q=electronics&limit=15'
      - think: 2
      - get:
          url: '/api/search?q=book&limit=10'

  - name: 'Report generation workflow'
    weight: 15
    flow:
      - get:
          url: '/api/reports/sales'
      - think: 5
      - get:
          url: '/health'

  - name: 'API exploration'
    weight: 5
    flow:
      - get:
          url: '/health'
      - get:
          url: '/api/cache/stats'
      - think: 1
      - get:
          url: '/api/products?page=2&limit=10'